In [4]:
import pandas as pd
import numpy as np

In [8]:
%store -r name_df

In [9]:
name_df.head()

   YearOfBirth       Name  Number
0         1880       Mary    7065
1         1880       Anna    2604
2         1880       Emma    2003
3         1880  Elizabeth    1939
4         1880     Minnie    1746

In [ ]:
#name cleaning
name_df = name_df.drop(columns=["Sex"])
name_df.head()

In [4]:
%store name_df

Stored 'name_df' (DataFrame)

In [12]:
cleaned_name = name_df

In [13]:
%store cleaned_name

Stored 'cleaned_name' (DataFrame)

In [2]:
%store -r cleaned_name

In [5]:
frames = [cleaned_name["YearOfBirth"], cleaned_name["Name"], cleaned_name["Number"]]
cleaned_name["Words"] = pd.concat(frames, ignore_index=True)

In [8]:
cleaned_name = cleaned_name[["Words"]]

In [9]:
cleaned_name.head()

  Words
0  1880
1  1880
2  1880
3  1880
4  1880

In [10]:
%store cleaned_name

Stored 'cleaned_name' (DataFrame)